---
type: StructuralInstanceUsageFilter
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralInstanceUsageFilter

`Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralInstanceUsageFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | StructuralUsage | 2011 | `public StructuralInstanceUsage StructuralUsage { get ; }` |